#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-wydStnnsEVJxKWcC

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
aws_eip.natgw_eip: Refreshing state... [id=eipalloc-0caa4fb94cb4971d9]
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
data.aws_region.current: Read complete after 0s [id=us-west-2]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_apigatewayv2_api.lambda: Refreshing state... [id=mnn47ekvw8]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-00cd02fe9fbaf7a9a]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:4]
data.aws_caller_identity.current: Read complete after 0s [id=847035122536]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_iam_role.db_init_role: Refreshing state... [id=db_init_role]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-07e4aca6461e65ec9]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_rds_cluster.vuln_db_cluster: Refreshing state... [id=vuln-db-cluster]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-09706ceeb283da7f4]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220620061502436700000002]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220620061502536700000005]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220620061502490300000004]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-2022062006152872580000000a]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220620061502637000000009]
aws_iam_role_policy_attachment.scanner_policy_attach_efs_access: Refreshing state... [id=scanner_role-20220620061502561500000006]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220620061502598600000008]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220620061502565800000007]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=sch06ac]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_iam_role_policy_attachment.db_init_policy_attach_lambda_basic: Refreshing state... [id=db_init_role-20220620061502455000000003]
aws_iam_role_policy_attachment.db_init_policy_attach_vpc_access: Refreshing state... [id=db_init_role-20220620063822236700000001]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=vugmn2e]
aws_iam_policy.rds_connect_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/rds_connect_policy]
aws_rds_cluster_instance.vuln_db_instance: Refreshing state... [id=tf-2022062006160966580000000b]
aws_iam_role_policy_attachment.scanner_policy_attach_rds_access: Refreshing state... [id=scanner_role-2022062006160985230000000d]
aws_iam_role_policy_attachment.db_init_policy_attach_rds_access: Refreshing state... [id=db_init_role-2022062006160984810000000c]
aws_route_table.private_rt: Refreshing state... [id=rtb-0ace0b8eb6a658e94]
aws_subnet.private_az2: Refreshing state... [id=subnet-043ce8e346211a36c]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_subnet.private_az1: Refreshing state... [id=subnet-052b710a3fb7476e2]
aws_route_table_association.subnet2_rt: Refreshing state... [id=rtbassoc-0c55e3ecdf6c3fc2c]
aws_route_table_association.subnet1_rt: Refreshing state... [id=rtbassoc-0b3085b17975cec92]
aws_db_subnet_group.private: Refreshing state... [id=private]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-059c1446d54fbf482]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-036f87c58caef165e]
aws_lambda_function.db_init: Refreshing state... [id=db_init]
aws_lambda_invocation.db_init: Refreshing state... [id=db_init_$LATEST_1530accf30cab891d759fa3cb8322250]
aws_cloudwatch_log_group.db_init: Refreshing state... [id=/aws/lambda/db_init]
aws_lambda_function.scanner: Refreshing state... [id=scanner]
aws_cloudwatch_log_group.scanner: Refreshing state... [id=/aws/lambda/scanner]
aws_lambda_event_source_mapping.example: Refreshing state... [id=7da72925-389e-4ed5-b750-bd763143d6b4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_subnet_group.public will be created
  + resource "aws_db_subnet_group" "public" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "public"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0e9b3892f4f02491c",
        ]
      + tags        = {
          + "Name" = "My public DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My public DB subnet group"
        }
    }

  # aws_iam_policy.rds_connect_policy will be updated in-place
  ~ resource "aws_iam_policy" "rds_connect_policy" {
        id          = "arn:aws:iam::847035122536:policy/rds_connect_policy"
        name        = "rds_connect_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "rds-db:connect" -> [
                          + "rds-db:connect",
                        ]
                      ~ Resource = [
                          - "arn:aws:rds-db:us-west-2:847035122536:dbuser:*/*",
                        ] -> "arn:aws:rds-db:us-west-2:847035122536:dbuser:*/test"
                      - Sid      = "VisualEditor0" -> null
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-21T03:54:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "m50MWSeqlTA7QMVzYGkvpP3wfFcVCtiMSrZ41fCJLVk=" -> "uLHK7MAsWl3LaK8oOcrlWc2WSXdU2Rqfle5iWo36Uro="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db_init will be updated in-place
  ~ resource "aws_lambda_function" "db_init" {
        id                             = "db_init"
      ~ last_modified                  = "2022-06-21T07:36:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "9frcsUGFeMwY8kklx5mtEZavfRXNYUGabHv6+b8z1RE=" -> "EKbm+FaF8fGJROkGD1x2ikLUcIt3IskzXeGg+nb1qwo="
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_DB_NAME" = "vuln_db"
              - "DB_HOST"     = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com"
              - "DB_USER"     = "test"
            } -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scanner will be updated in-place
  ~ resource "aws_lambda_function" "scanner" {
        id                             = "scanner"
      ~ last_modified                  = "2022-06-21T03:54:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "32m1bnif7aqgQFBntl3MV0ZkXfy9Di/SM48x08yfxUo=" -> "onHXzJR3Xq4eAIlm432CKgmvkPDg8w/WsuvE1shqaNk="
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_DB_NAME" = "vuln_db"
              - "DB_HOST"     = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com"
              - "DB_USER"     = "test"
              - "HOME"        = "/tmp/"
              - "mountPath"   = "/mnt/nuclei"
              - "nucleiUrl"   = "https://github.com/projectdiscovery/nuclei/releases/download/v2.7.2/nuclei_2.7.2_linux_amd64.zip"
              - "sqsUrl"      = "https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls"
            } -> (known after apply)
        }




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-21T03:54:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1y6/usli+9KN5xJlUE5W05/ARegbxbBglU1lFqL1uM=" -> "7hwQiQ8JaTUdDJ/CRRzTgA0jVxH6fWKRH08MdXjFpSc="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_rds_cluster.vuln_db_cluster must be replaced
-/+ resource "aws_rds_cluster" "vuln_db_cluster" {
      ~ allocated_storage                   = 1 -> (known after apply)
      + apply_immediately                   = (known after apply)
      ~ arn                                 = "arn:aws:rds:us-west-2:847035122536:cluster:vuln-db-cluster" -> (known after apply)
      ~ availability_zones                  = [
          - "us-west-2a",
          - "us-west-2b",
          - "us-west-2c",
        ] -> (known after apply)
      - backtrack_window                    = 0 -> null
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [
          - "tf-2022062006160966580000000b",
        ] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-TD5FZG24ZIK4ZODB7ESPBJY24Q" -> (known after apply)
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql13" -> (known after apply)
      ~ db_subnet_group_name                = "private" -> (known after apply) # forces replacement
      - deletion_protection                 = false -> null
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual               = "13.6" -> (known after apply)
      ~ hosted_zone_id                      = "Z1PVIF0B656C1W" -> (known after apply)
      ~ iam_roles                           = [] -> (known after apply)
      ~ id                                  = "vuln-db-cluster" -> (known after apply)
      - iops                                = 0 -> null
      + kms_key_id                          = (known after apply)
      ~ port                                = 5432 -> (known after apply)
      ~ preferred_backup_window             = "07:31-08:01" -> (known after apply)
      ~ preferred_maintenance_window        = "tue:10:14-tue:10:44" -> (known after apply)
      ~ reader_endpoint                     = "vuln-db-cluster.cluster-ro-ci1sahf4rlmb.us-west-2.rds.amazonaws.com" -> (known after apply)
      ~ storage_encrypted                   = false -> (known after apply)
      - tags                                = {} -> null
      ~ tags_all                            = {} -> (known after apply)
      ~ vpc_security_group_ids              = [
          - "sg-0dfa3e4d75f7cdb3a",
        ] -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_rds_cluster_instance.vuln_db_instance must be replaced
-/+ resource "aws_rds_cluster_instance" "vuln_db_instance" {
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-west-2:847035122536:db:tf-2022062006160966580000000b" -> (known after apply)
      ~ availability_zone                     = "us-west-2a" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      ~ cluster_identifier                    = "vuln-db-cluster" -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "default.aurora-postgresql13" -> (known after apply)
      ~ db_subnet_group_name                  = "private" -> (known after apply) # forces replacement
      ~ dbi_resource_id                       = "db-X3X3HPEBHERWSD4EYAH4UHBQUQ" -> (known after apply)
      ~ endpoint                              = "tf-2022062006160966580000000b.ci1sahf4rlmb.us-west-2.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "13.6" -> (known after apply)
      ~ id                                    = "tf-2022062006160966580000000b" -> (known after apply)
      ~ identifier                            = "tf-2022062006160966580000000b" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      + kms_key_id                            = (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ performance_insights_enabled          = false -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "07:31-08:01" -> (known after apply)
      ~ preferred_maintenance_window          = "mon:09:47-mon:10:17" -> (known after apply)
      ~ storage_encrypted                     = false -> (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      ~ writer                                = true -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ rds_arn = "arn:aws:rds:us-west-2:847035122536:cluster:vuln-db-cluster/test" -> (known after apply)

```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*